Функция SalaryStatement(Запрос)    
   
   УстановитьПривилегированныйРежим(Истина);
   
   ДатаСрезаСтрокой = Запрос.ПараметрыЗапроса.Получить("datefrom");
   
   Если ДатаСрезаСтрокой <> Неопределено Тогда
      
      ДатаСреза = Дата(ДатаСрезаСтрокой);
      
      Если ТипЗнч(ДатаСреза) = Тип("Дата") И ДатаСреза <> Дата(1,1,1) Тогда
         
         Запрос = Новый Запрос;
         Запрос.Текст = "ВЫБРАТЬ
                        |  ""ВедомостьНаВыплатуЗарплаты"" КАК ТипДокумента,
                        |  ПРЕДСТАВЛЕНИЕ(ВедомостьНаВыплатуЗарплаты.ВидМестаВыплаты) КАК ТипВыплаты,
                        |  ВедомостьНаВыплатуЗарплаты.Номер КАК Номер,
                        |  ВедомостьНаВыплатуЗарплаты.Комментарий КАК Комментарий,
                        |  ВедомостьНаВыплатуЗарплаты.Дата КАК Дата,
                        |  ВедомостьНаВыплатуЗарплаты.СуммаДокумента КАК СуммаДокумента,
                        |  ПРЕДСТАВЛЕНИЕ(ВедомостьНаВыплатуЗарплаты.Организация) КАК Организация
                        |ИЗ
                        |  Документ.ВедомостьНаВыплатуЗарплаты КАК ВедомостьНаВыплатуЗарплаты
                        |ГДЕ
                        |  НЕ ВедомостьНаВыплатуЗарплаты.ПометкаУдаления
                        |  И ВедомостьНаВыплатуЗарплаты.Дата >= &ДатаСреза
                        |
                        |ОБЪЕДИНИТЬ ВСЕ
                        |
                        |ВЫБРАТЬ
                        |  ""ВедомостьНаВыплатуЗарплатыВБанк"",
                        |  ПРЕДСТАВЛЕНИЕ(ВедомостьНаВыплатуЗарплатыВБанк.ВидМестаВыплаты),
                        |  ВедомостьНаВыплатуЗарплатыВБанк.Номер,
                        |  ВедомостьНаВыплатуЗарплатыВБанк.Комментарий,
                        |  ВедомостьНаВыплатуЗарплатыВБанк.Дата,
                        |  ВедомостьНаВыплатуЗарплатыВБанк.СуммаПоДокументу,
                        |  ПРЕДСТАВЛЕНИЕ(ВедомостьНаВыплатуЗарплатыВБанк.Организация)
                        |ИЗ
                        |  Документ.ВедомостьНаВыплатуЗарплатыВБанк КАК ВедомостьНаВыплатуЗарплатыВБанк
                        |ГДЕ
                        |  НЕ ВедомостьНаВыплатуЗарплатыВБанк.ПометкаУдаления
                        |  И ВедомостьНаВыплатуЗарплатыВБанк.Дата >= &ДатаСреза";
         
         
         
         Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
         ТЗ = Запрос.Выполнить().Выгрузить();       
         
                
         ЗаписьJSON = Новый ЗаписьJSON;
         ЗаписьJSON.УстановитьСтроку();
         СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ТЗ, НазначениеТипаXML.Явное);
         СтрокаJSON = ЗаписьJSON.Закрыть();
         
         
         // ВАРИАНТ ЧЕРЕЗ ФУНКИЦЮ
         //СтрокаJSON = РезультатЗапросаВJSONНаСервере(Запрос, Ложь);
         
         
         Ответ = Новый HTTPСервисОтвет(200); 
         
         //МассивЗначений = Новый Массив;
         //МассивЗначений.Добавить(1);
         //МассивЗначений.Добавить("два");
         //МассивЗначений.Добавить(ТекущаяДата());
         //СоответствиеЗначенией = Новый Соответствие;
         //СоответствиеЗначенией.Вставить("123", 123);
         //МассивЗначений.Добавить(СоответствиеЗначенией);
         //ЗначениеДляЗаписи = Новый ФиксированныйМассив(МассивЗначений);
         //
         //ЗаписьJSON = Новый ЗаписьJSON;
         //ЗаписьJSON.УстановитьСтроку();
         //ЗаписатьJSON(ЗаписьJSON, ЗначениеДляЗаписи);
         //СтрокаJSON = ЗаписьJSON.Закрыть();
         
         Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
         
      Иначе 
         
         Ответ = Новый HTTPСервисОтвет(404);
         Ответ.Причина = "Нет данных";
         Ответ.УстановитьТелоИзСтроки("нет данных", КодировкаТекста.UTF8);
      КонецЕсли;
      Иначе
        Ответ = Новый HTTPСервисОтвет(404);
        Ответ.Причина = "Нет данных";
        Ответ.УстановитьТелоИзСтроки("нет данных", КодировкаТекста.UTF8);
      
   КонецЕсли;
   
   УстановитьПривилегированныйРежим(Ложь);
   
   Возврат Ответ;   
	
КонецФункции

&НаСервере
Функция ТаблицаЗначенийВМассивУниверсальная(ТаблицаЗначений)
	
	ЗначениеJSONдляNULL = ""; //или "NULL", "НЕОПРЕДЕЛЕНО" и т.п.
	
	Массив = Новый Массив();
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		
		СтруктураСтроки = Новый Структура();
		
		Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
			
			ИмяКолонки        = Колонка.Имя;
			ЗначениеРеквизита = СтрокаТаблицы[ИмяКолонки];
			
			ТипЗначения = ТипЗнч(ЗначениеРеквизита);
			
			Если ТипЗначения = Тип("Число")  ИЛИ
				 ТипЗначения = Тип("Строка") ИЛИ
				 ТипЗначения = Тип("Булево") ИЛИ
				 ТипЗначения = Тип("Дата")   Тогда
				 
				СтруктураСтроки.Вставить(ИмяКолонки, ЗначениеРеквизита);
				
			ИначеЕсли ТипЗначения = Тип("Null") Тогда
				 
				СтруктураСтроки.Вставить(ИмяКолонки, ЗначениеJSONдляNULL);
				
			ИначеЕсли ТипЗначения = Тип("ТаблицаЗначений") Тогда
				 
				СтруктураСтроки.Вставить(ИмяКолонки, ТаблицаЗначенийВМассивУниверсальная(ЗначениеРеквизита)); 
				
			Иначе
				
				ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
				
				Если ОбъектМетаданных = Неопределено Тогда
					Сообщить("Не найдено описание для: "+ИмяКолонки+"_"+ЗначениеРеквизита+"_"+ТипЗначения);
					Продолжить;
				КонецЕсли;
				
				Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
					
					СтруктураСтроки.Вставить(ИмяКолонки,         СокрЛП(ЗначениеРеквизита));
					СтруктураСтроки.Вставить(ИмяКолонки+"_Код",  ЗначениеРеквизита.Код); //ОбъектМетаданных.ДлинаКода
					СтруктураСтроки.Вставить(ИмяКолонки+"_ГУИД", СокрЛП(ЗначениеРеквизита.УникальныйИдентификатор()));
					СтруктураСтроки.Вставить(ИмяКолонки+"_Тип",  "Справочники."+ОбъектМетаданных.Имя);
					
				ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
					
					СтруктураСтроки.Вставить(ИмяКолонки,          СокрЛП(ЗначениеРеквизита));
					СтруктураСтроки.Вставить(ИмяКолонки+"_Номер", ЗначениеРеквизита.Номер);
					СтруктураСтроки.Вставить(ИмяКолонки+"_Дата",  ЗначениеРеквизита.Дата);
					СтруктураСтроки.Вставить(ИмяКолонки+"_ГУИД",  СокрЛП(ЗначениеРеквизита.УникальныйИдентификатор()));
					СтруктураСтроки.Вставить(ИмяКолонки+"_Тип",  "Документы."+ОбъектМетаданных.Имя);
					
				ИначеЕсли Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
					
					Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
						ИмяПеречисления = ЗначениеРеквизита.Метаданные().Имя;
						ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеРеквизита);
						ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
					Иначе
						ИмяЗначенияПеречисления = "";
					КонецЕсли;
					
					СтруктураСтроки.Вставить(ИмяКолонки,         СокрЛП(ЗначениеРеквизита));
					СтруктураСтроки.Вставить(ИмяКолонки+"_Имя",  СокрЛП(ИмяЗначенияПеречисления));
					СтруктураСтроки.Вставить(ИмяКолонки+"_Тип",  "Перечисления."+ОбъектМетаданных.Имя);
					
				ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
					
					СтруктураСтроки.Вставить(ИмяКолонки,         СокрЛП(ЗначениеРеквизита));
					СтруктураСтроки.Вставить(ИмяКолонки+"_Код",  ЗначениеРеквизита.Код); //ОбъектМетаданных.ДлинаКода
					СтруктураСтроки.Вставить(ИмяКолонки+"_ГУИД", СокрЛП(ЗначениеРеквизита.УникальныйИдентификатор()));
					СтруктураСтроки.Вставить(ИмяКолонки+"_Тип",  "ПланыВидовХарактеристик."+ОбъектМетаданных.Имя);
					
				ИначеЕсли Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных) Тогда
					
					СтруктураСтроки.Вставить(ИмяКолонки,         СокрЛП(ЗначениеРеквизита));
					СтруктураСтроки.Вставить(ИмяКолонки+"_Код",  ЗначениеРеквизита.Код); //ОбъектМетаданных.ДлинаКода
					СтруктураСтроки.Вставить(ИмяКолонки+"_ГУИД", СокрЛП(ЗначениеРеквизита.УникальныйИдентификатор()));
					СтруктураСтроки.Вставить(ИмяКолонки+"_Тип",  "ПланыСчетов."+ОбъектМетаданных.Имя);
					
				ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных) Тогда
					
					СтруктураСтроки.Вставить(ИмяКолонки,         СокрЛП(ЗначениеРеквизита));
					СтруктураСтроки.Вставить(ИмяКолонки+"_Код",  ЗначениеРеквизита.Код); //ОбъектМетаданных.ДлинаКода
					СтруктураСтроки.Вставить(ИмяКолонки+"_ГУИД", СокрЛП(ЗначениеРеквизита.УникальныйИдентификатор()));
					СтруктураСтроки.Вставить(ИмяКолонки+"_Тип",  "ПланыВидовРасчета."+ОбъектМетаданных.Имя);
					
				Иначе
					
					Сообщить("Не найдено описание для: "+ИмяКолонки+"_"+ЗначениеРеквизита+"_"+ТипЗначения+"_"+ОбъектМетаданных);
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;  // Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		
		Массив.Добавить(СтруктураСтроки);
		
	КонецЦикла;  // Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
	
	Возврат Массив;

КонецФункции  // ТаблицаЗначенийВМассивУниверсальная(ТаблицаЗначений)

&НаСервере
Функция РезультатЗапросаВJSONНаСервере(обЗапрос, ЭтоПакет)
	
	
	Если ЭтоПакет Тогда
		РезультатыЗапроса = обЗапрос.ВыполнитьПакет();
	Иначе
		РезультатЗапроса  = обЗапрос.Выполнить();
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Истина;

	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
    ЗаписьJSON.ЗаписатьИмяСвойства("ТекущееВремя");
	ЗаписатьJSON(ЗаписьJSON, ТекущаяДата());  
	
	Если ЭтоПакет Тогда
		
		СчетчикРезультатов = 0;
		Для Каждого РезультатЗапроса Из РезультатыЗапроса Цикл
			
			СчетчикРезультатов = СчетчикРезультатов + 1;
			ТЗ = РезультатЗапроса.Выгрузить();
			Массив = ТаблицаЗначенийВМассивУниверсальная(ТЗ);

		    ЗаписьJSON.ЗаписатьИмяСвойства("РезультатЗапроса"+СчетчикРезультатов);
			ЗаписатьJSON(ЗаписьJSON, Массив);
			
		КонецЦикла;	
		
	Иначе
		
		ТЗ = РезультатЗапроса.Выгрузить();
		Массив = ТаблицаЗначенийВМассивУниверсальная(ТЗ);

	    ЗаписьJSON.ЗаписатьИмяСвойства("РезультатЗапроса");
		ЗаписатьJSON(ЗаписьJSON, Массив);  
		
	КонецЕсли;
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	РезультатJSON = ЗаписьJSON.Закрыть();   
	
	Возврат РезультатJSON;
	
КонецФункции  // РезультатЗапросаВJSONНаСервере()

//Проверка коннекта
Функция PingMe(Запрос)
   
	ТекстОтвета = "ОК";
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТекстОтвета,КодировкаТекста.UTF8);	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Возврат Ответ;

КонецФункции

